In [1]:
import sqlite3
from p_sqlite3_employee import Employee

DB 연결, 커서 획득

In [2]:
# DB creation, isolation_level=None 쿼리문 실행하여 db에 즉시 반영, 자동커밋
# 있으면 연결, 없으면 만듬
conn = sqlite3.connect("test.db", isolation_level=None)

# coursor acquire
c = conn.cursor()

In [ ]:
# Creating a table 1
c.execute("""CREATE TABLE employees (
            firstname text,
            lastname text,
            pay integer
            )""")

conn.commit() 
conn.close()

In [5]:
# Creating a table 2
c.execute("CREATE TABLE IF NOT EXISTS userusage \
    (id integer PRIMARY KEY, \
        name text, \
        birthday text)")

Insert values

In [9]:
# insert single value
c.execute("INSERT INTO employees VALUES('Corey','Schafer',50000)")
c.execute("INSERT INTO employees VALUES('Corey','Schafer',70000)")

In [25]:
emp1 = Employee('kelly', 'H', 55000)
emp2 = Employee('Age', 'H', 55000)
emp3 = Employee('Charlie', 'H', 65000)
emp4 = Employee('young', 'Kim', 65000)

In [9]:
c.execute("INSERT INTO employees VALUES('{}','{}',{})".format(emp1.first, emp1.last, emp1.pay))

In [11]:
c.execute("INSERT INTO employees VALUES(?,?,?)", (emp2.first, emp2.last, emp2.pay))

In [15]:
c.execute("INSERT INTO employees VALUES(:first,:last,:pay)", {'first':emp3.first, 'last':emp3.last, 'pay':emp3.pay})

In [16]:
c.execute("SELECT * FROM employees")
# c.fetchmany(5) #select number of query
# c.fetchone() # select on query
c.fetchall()

[('Corey', 'Schafer', 50000),
 ('Corey', 'Schafer', 50000),
 ('Corey', 'Schafer', 70000),
 ('kelly', 'H', 55000),
 ('Age', 'H', 55000),
 ('Age', 'H', 55000),
 ('Charlie', 'H', 65000)]

In [20]:
# 딕셔너리형태로 찾기
c.execute("SELECT * FROM employees WHERE lastname=:last",{'last':'H'})
c.fetchall()

[('kelly', 'H', 55000),
 ('Age', 'H', 55000),
 ('Age', 'H', 55000),
 ('Charlie', 'H', 65000)]

In [22]:
c.execute("SELECT * FROM employees WHERE lastname=?",('Schafer',))
c.fetchall()

[('Corey', 'Schafer', 50000),
 ('Corey', 'Schafer', 50000),
 ('Corey', 'Schafer', 70000)]

In [43]:
def insert_emp(emp):
    with conn:
        c.execute("INSERT INTO employees VALUES(:first,:last,:pay)", \
            {'first':emp.first, 'last':emp.last, 'pay':emp.pay})

def get_emp_all():
    c.execute("SELECT * FROM employees")
    print(f'\n print all')
    return c.fetchall()

def get_emps_by_name(lastname):
    c.execute("SELECT * FROM employees WHERE lastname=:last",{'last':lastname})
    return c.fetchall()

def update_pay(emp, pay):
    with conn:
        c.execute("UPDATE employees SET pay =:pay WHERE firstname=:first AND lastname=:last",\
            {'first': emp.first, 'last': emp.last, 'pay': pay})

def remove_emp(emp):
    with conn:
        c.execute("DELETE from employees WHERE firstname=:first AND lastname=:last",{'first':emp.first, 'last':emp.last})

In [44]:
insert_emp(emp4)
print(get_emps_by_name('H'))
print(get_emp_all())
update_pay(emp4, 100000)
print(get_emp_all())
remove_emp(emp2)
print(get_emp_all())

[('kelly', 'H', 55000), ('Charlie', 'H', 65000)]

 print all
[('Corey', 'Schafer', 50000), ('Corey', 'Schafer', 50000), ('Corey', 'Schafer', 70000), ('kelly', 'H', 55000), ('Charlie', 'H', 65000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 65000)]

 print all
[('Corey', 'Schafer', 50000), ('Corey', 'Schafer', 50000), ('Corey', 'Schafer', 70000), ('kelly', 'H', 55000), ('Charlie', 'H', 65000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000)]

 print all
[('Corey', 'Schafer', 50000), ('Corey', 'Schafer', 50000), ('Corey', 'Schafer', 70000), ('kelly', 'H', 55000), ('Charlie', 'H', 65000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000), ('young', 'Kim', 100000)]

In [4]:
conn.commit()
conn.close()

reference  
Youtube python SQLite... [https://youtu.be/pd-0G0MigUA]